tap "apple/apple"
tap "ariga/tap"
tap "charmbracelet/tap"
tap "gcenx/apple"
tap "gcenx/wine"
tap "modularml/packages"
tap "oven-sh/bun"
tap "sdkman/tap"
tap "sikarugir-app/sikarugir"
brew "bat"
brew "broot"
brew "btop"
brew "icu4c@77"
brew "chafa"
brew "d2"
brew "dart-sdk"
brew "delve"
brew "deno"
brew "direnv"
brew "dive"
brew "dua-cli"
brew "dust"
brew "elixir"
brew "elm"
brew "eza"
brew "fd"
brew "felinks"
brew "libarchive"
brew "ffmpeg"
brew "fnm"
brew "fpc"
brew "fselect"
brew "fzf"
brew "gcc"
brew "ghcup"
brew "git"
brew "git-delta"
brew "gleam"
brew "glow"
brew "gnu-apl"
brew "gnucobol"
brew "lua"
brew "gnuplot"
brew "go"
brew "grype"
brew "hyperfine"
brew "imagemagick"
brew "jj"
brew "just"
brew "kondo"
brew "lazygit"
brew "llvm@20"
brew "lld@20"
brew "mailsy"
brew "mask"
brew "mermaid-cli"
brew "mintoolkit"
brew "molten-vk"
brew "tree-sitter"
brew "neovim"
brew "nushell"
brew "opam"
brew "pandoc"
brew "php"
brew "pkl"
brew "plantuml"
brew "posting"
brew "presenterm"
brew "release-it"
brew "ripgrep"
brew "ripgrep-all"
brew "ruby"
brew "rustup"
brew "sqlc"
brew "swi-prolog"
brew "tectonic"
brew "thefuck"
brew "tokei"
brew "tree"
brew "tree-sitter-cli"
brew "trivy"
brew "uv"
brew "xh"
brew "yazi"
brew "yt-dlp"
brew "zig"
brew "zoxide"
brew "ariga/tap/atlas"
brew "charmbracelet/tap/freeze"
brew "charmbracelet/tap/wishlist"
brew "oven-sh/bun/bun"
brew "sdkman/tap/sdkman-cli"
cask "aldente"
cask "alt-tab"
cask "android-studio"
cask "appcleaner"
cask "arc"
cask "bruno"
cask "cloudflare-warp"
cask "dbeaver-community"
cask "devtoys"
cask "discord"
cask "docker-desktop"
cask "dolphin"
cask "duckduckgo"
cask "figma"
cask "firefox"
cask "firefox@developer-edition"
cask "font-jetbrains-mono-nerd-font"
cask "free-download-manager"
cask "ghostty"
cask "gimp"
cask "google-chrome"
cask "gray"
cask "gstreamer-runtime"
cask "handbrake-app"
cask "iina"
cask "imageoptim"
cask "inkscape"
cask "intellij-idea-ce"
cask "keka"
cask "keyboardcleantool"
cask "maccy"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "middleclick"
cask "monitorcontrol"
cask "ngrok"
cask "nota"
cask "notion"
cask "notion-calendar"
cask "notion-mail"
cask "obsidian"
cask "onyx"
cask "openemu"
cask "pearcleaner"
cask "playcover-community"
cask "porting-kit"
cask "postman"
cask "qbittorrent"
cask "raycast"
cask "rectangle"
cask "sikarugir"
cask "slite"
cask "spotify"
cask "steam"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "vscodium"
cask "whatsapp"
cask "whisky"
cask "wireshark-app"
cask "wwdc"
cask "yacreader"
cask "zen"
vscode "github.codespaces"
vscode "ms-vscode-remote.remote-containers"
vscode "pkief.material-icon-theme"
vscode "vscodevim.vim"
