tap "apple/apple", "http://github.com/apple/homebrew-apple"
tap "bell-sw/liberica"
tap "brewsci/science"
tap "buo/cask-upgrade"
tap "gcenx/wine"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "oven-sh/bun"
brew "brotli"
brew "giflib"
brew "highway"
brew "imath"
brew "jpeg-turbo"
brew "libpng"
brew "lz4"
brew "xz"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "openexr"
brew "webp"
brew "jpeg-xl"
brew "libvmaf"
brew "aom"
brew "ca-certificates"
brew "gettext"
brew "openssl@3"
brew "libssh2"
brew "readline"
brew "sqlite"
brew "aria2"
brew "aribb24"
brew "m4"
brew "bat"
brew "bdw-gc"
brew "berkeley-db"
brew "freetype"
brew "fontconfig"
brew "mpdecimal"
brew "pcre2"
brew "glib"
brew "xorgproto"
brew "libxau"
brew "libxdmcp"
brew "libxcb"
brew "libx11"
brew "libxext"
brew "libxrender"
brew "lzo"
brew "pixman"
brew "cairo"
brew "cjson"
brew "cmake"
brew "cmocka"
brew "gmp"
brew "coreutils"
brew "cython"
brew "dav1d"
brew "deno"
brew "libevent"
brew "libunistring"
brew "libidn2"
brew "libnghttp2"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "jansson"
brew "tree-sitter"
brew "emacs"
brew "eza"
brew "fd"
brew "libogg"
brew "flac"
brew "frei0r"
brew "fribidi"
brew "graphite2"
brew "harfbuzz"
brew "icu4c"
brew "lame"
brew "openjpeg"
brew "leptonica"
brew "libb2"
brew "libarchive"
brew "libunibreak"
brew "libass"
brew "libbluray"
brew "mbedtls"
brew "librist"
brew "libsamplerate"
brew "libvorbis"
brew "mpg123"
brew "opus"
brew "libsndfile"
brew "libsodium"
brew "libsoxr"
brew "libvidstab"
brew "libvpx"
brew "opencore-amr"
brew "pango"
brew "rav1e"
brew "rubberband"
brew "sdl2"
brew "snappy"
brew "speex"
brew "srt"
brew "svt-av1"
brew "tesseract"
brew "theora"
brew "x264"
brew "x265"
brew "xvid"
brew "zeromq"
brew "zimg"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "gh"
brew "ghostscript"
brew "git"
brew "go"
brew "libtool"
brew "pkg-config"
brew "guile"
brew "ncurses"
brew "htop"
brew "openjdk"
brew "kotlin"
brew "latexindent"
brew "lazygit"
brew "libcbor"
brew "libfido2"
brew "libomp"
brew "unibilium"
brew "libtermkey"
brew "libuv"
brew "libvterm"
brew "libyaml"
brew "lua"
brew "luajit"
brew "luv"
brew "lynx"
brew "node"
brew "mailsy"
brew "msgpack"
brew "zlib"
brew "mysql"
brew "neovim"
brew "ollama"
brew "openblas"
brew "pcre"
brew "portaudio"
brew "pycodestyle"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ripgrep"
brew "ruby"
brew "six", link: false
brew "speedtest-cli"
brew "tcl-tk"
brew "thefuck"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "yt-dlp"
brew "zoxide"
brew "zsh"
brew "oven-sh/bun/bun"
cask "aldente"
cask "alfred"
cask "alt-tab"
cask "amazon-q"
cask "android-platform-tools"
cask "android-studio"
cask "appcleaner"
cask "arc"
cask "asana"
cask "authy"
cask "balenaetcher"
cask "blender"
cask "brave-browser"
cask "cheatsheet"
cask "cloudflare-warp"
cask "cursor"
cask "discord"
cask "docker"
cask "drawio"
cask "excalidrawz"
cask "figma"
cask "firefox"
cask "firefox-developer-edition"
cask "flutter"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "gaphor"
cask "git-it"
cask "gitbutler"
cask "github"
cask "gitup"
cask "google-chrome"
cask "grammarly-desktop"
cask "gray"
cask "handbrake"
cask "hiddenbar"
cask "iina"
cask "imageoptim"
cask "inkscape"
cask "intellij-idea-ce"
cask "iterm2"
cask "keka"
cask "keyboardcleantool"
cask "kitty"
cask "latexdraw"
cask "logisim-evolution"
cask "maccy"
cask "mactex"
cask "mars"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "microsoft-teams-classic"
cask "middleclick"
cask "monitorcontrol"
cask "monodraw"
cask "mos"
cask "mysqlworkbench"
cask "notion"
cask "notion-calendar"
cask "obsidian"
cask "onyx"
cask "openemu"
cask "opera"
cask "opera-gx"
cask "orion"
cask "processing"
cask "qbittorrent"
cask "rectangle"
cask "shottr"
cask "sigmaos"
cask "spotify"
cask "telegram"
cask "the-unarchiver"
cask "tor-browser"
cask "utm"
cask "visual"
cask "visual-studio-code"
cask "vivaldi"
cask "warp"
cask "whatsapp"
cask "whisky"
cask "wwdc"
cask "xnconvert"
cask "xquartz"
cask "yacreader"
cask "zed"
cask "zen-browser"
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fivethree.vscode-svelte-snippets"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "james-yu.latex-workshop"
vscode "jeff-hykin.better-cpp-syntax"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "million.million-lint"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "pkief.material-icon-theme"
vscode "ritwickdey.liveserver"
vscode "sirtori.indenticator"
vscode "steoates.autoimport"
vscode "supermaven.supermaven"
vscode "svelte.svelte-vscode"
vscode "usernamehw.errorlens"
vscode "vintharas.learn-vim"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
